# How to create a DataFrame using "dictionary"

In [1]:
import pandas as pd

In [18]:
friend_dict_list = [
    {'name': 'John', 'age': 25, 'job': 'student'},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'}
]

In [19]:
df = pd.DataFrame(friend_dict_list)

In [20]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

dictionary disadvantage : column is not in order

In [21]:
df = df[['name', 'age','job']]

In [22]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

## Ordered dictionary

ordered dictionary can make dictionary in order

In [23]:
from collections import OrderedDict

In [24]:
friend_ordered_dict = OrderedDict(
    [
        ('name',['John', 'Nate']),
        ('age',[25,30]),
        ('job',['student','teacher'])
    ]
)

In [25]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [26]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

# How to create a DataFrame using "List"

In [27]:
friend_list = [
    ['John',25,'student'],
    ['Nate',30,'teacher']
]

In [28]:
column_name = ['name','age','job']

In [29]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [30]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

## Add column name at once

In [32]:
friend_list = [
    ['name', ['John', 'Nate']],
    ['age', [25,30]],
    ['job',['student','teacher']],    
]

In [34]:
df = pd.DataFrame.from_items(friend_list)

/Users/shinchan-yeop/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

In [35]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher